In [1]:
import pandas as pd
import numpy as np

### groupby agg
* https://stackoverflow.com/questions/33780794/how-to-sum-negative-and-positive-values-separately-when-using-groupby-in-pandas

In [2]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar', 'foo', 'bar', 'foo', 'foo'],
                   'B' : ['one', 'one', 'two', 'three', 'two', 'two', 'one', 'three'],
                   'C' : np.random.randn(8), 'D' : np.random.randn(8)})

df

     A      B         C         D
0  foo    one  1.306946 -1.736363
1  bar    one -0.775768 -0.487898
2  foo    two  2.086824  0.336119
3  bar  three  0.213084  2.119266
4  foo    two  1.532665 -0.144548
5  bar    two  1.130718 -1.577562
6  foo    one -1.736201 -0.314309
7  foo  three -0.453435 -0.095895

In [3]:
df.groupby(df['A'])['C'].agg(
    [('negative' , lambda x : x[x < 0].sum()) , 
     ('positive' , lambda x : x[x > 0].sum())]
)

     negative  positive
A
bar -0.775768  1.343802
foo -2.189636  4.926436

### pandas get rows which are NOT in other dataframe
* https://stackoverflow.com/questions/28901683/pandas-get-rows-which-are-not-in-other-dataframe

In [4]:
df1 = pd.DataFrame(data = {'col1' : [1, 2, 3, 4, 5], 'col2' : [10, 11, 12, 13, 14]}) 
df2 = pd.DataFrame(data = {'col1' : [1, 2, 3], 'col2' : [10, 11, 12]})

In [5]:
# method 1
common = df1.merge(df2,on=['col1','col2'])
print(common)
df1[(~df1.col1.isin(common.col1))&(~df1.col2.isin(common.col2))]

   col1  col2
0     1    10
1     2    11
2     3    12

   col1  col2
3     4    13
4     5    14

In [6]:
# method 2
df1[~df1.isin(df2)].dropna()

   col1  col2
3   4.0  13.0
4   5.0  14.0

In [7]:
# method
pd.concat([df1, df2]).drop_duplicates(keep=False, inplace=False)

   col1  col2
3     4    13
4     5    14